# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. 
# За каждой партой может сидеть два учащихся. 
# Известно количество учащихся в каждом из трех классов. 
# Выведите наименьшее число парт, которое нужно приобрести для них.

a, b, c = 20, 21, 22

sum = (a + 1)//2 + (b + 1)//2 + (c + 1)//2

print(sum)